validation/AMR/hysingBenchmark/RANS/2D/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains	1;

decomposer      	scotch;
distributor     	scotch;

libs                ("libfvMeshTopoChangers2D.so");
constraints
{
   refinementHistory4
   {
       type    refinementHistory4;
   }
}

// ************************************************************************* //
